PARTY_NAMES = [
    "ประชาธิปัตย์", "ประชากรไทย", "ความหวังใหม่", "เครือข่ายชาวนาแห่งประเทศไทย",
    "เพื่อไทย", "ชาติพัฒนา", "ชาติไทยพัฒนา", "อนาคตไทย", "ภูมิใจไทย",
    "สังคมประชาธิปไตยไทย", "รักชาติ", "ประชาธิปไตยใหม่", "พลังบูรพา",
    "ครูไทยเพื่อประชาชน", "พลังท้องถิ่นไท", "ประชาชน", "ไทยก้าวใหม่",
    "เสรีรวมไทย", "รักษ์ธรรม", "พลังประชาธิปไตย", "พลังสุราษฎร์",
    "พลังไทยรักชาติ", "เพื่อชีวิตใหม่", "ทางเลือกใหม่", "เศรษฐกิจ",
    "สร้างอนาคตไทย", "พลังธรรมใหม่", "ไทยธรรม", "รวมพลัง", "ไทยพร้อม",
    "ปวงชนไทย", "เพื่อชาติไทย", "ก้าวอิสระ", "ประชาชาติ", "แผ่นดินธรรม",
    "คลองไทย", "พลังประชารัฐ", "เศรษฐกิจใหม่", "พลังสังคม", "เป็นธรรม",
    "พลังเพื่อไทย", "ประชาไทย", "กรีน", "วิชชั่นใหม่", "พลวัต",
    "กล้าธรรม", "ไทยรวมไทย", "กล้า", "ฟิวชัน", "พลังสังคมใหม่",
    "ไทยสร้างไทย", "รวมไทยสร้างชาติ", "มิติใหม่", "ไทยสมาร์ท",
    "ไทยภักดี", "ไทยพิทักษ์ธรรม", "ไทยชนะ", "ไทรวมพลัง", "ราษฎร์วิถี",
    "โอกาสใหม่", "ท้องที่ไทย", "ใหม่", "แรงงานสร้างชาติ", "ไทยก้าวหน้า",
    "ตะวันใหม่", "พร้อม", "รวมใจไทย", "สัมมาธิปไตย", "รักภูเก็ต",
    "ประชาอาสาชาติ", "ไทยทรัพย์ทวี", "รวมพลังประชาชน", "อนาคตไกล",
    "ยางพาราไทย", "เพื่อบ้านเมือง"
]